0. 所有的题目结果中，给出SQL语句和执行结果。

In [43]:
import mysql.connector
db = mysql.connector.connect(
  host="localhost",
  user="root",
  password="123456",
  database="DaSE"
)
cursor = db.cursor()

1. 在新数据库中新建一张 user 表,插入几条数据,属性包含:唯一标识(id),姓名(name)性别(sex).年龄(age).联系方式(phone)，数据如下：

    ('John Doe', 'Male', 25, '123-456-7890')

    ('Jane Smith', 'Female', 31, '987-654-3210')
    
    ('Bob Johnson', 'Male', 22, '555-123-4567')

In [44]:
sql = "CREATE TABLE user (id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), sex VARCHAR(255), age INT, phone VARCHAR(255))"
cursor.execute(sql)

In [45]:
sql = "INSERT INTO user (name, sex, age, phone) VALUES (%s, %s, %s, %s)"
values = [('John Doe', 'Male', 25, '123-456-7890'), 
        ('Jane Smith', 'Female', 31, '987-654-3210'),
        ('Bob Johnson', 'Male', 22, '555-123-4567')]
cursor.executemany(sql, values)

2. 写出 SQL语句,查询 user 表中所有年龄在 20-30 范围内的用户

In [46]:
sql = "SELECT * FROM user Where age BETWEEN 20 AND 30"
cursor.execute(sql)
for row in cursor:
    print(row)

(1, 'John Doe', 'Male', 25, '123-456-7890')
(3, 'Bob Johnson', 'Male', 22, '555-123-4567')

3. 写出SQL语句，向user表中添加自己的个人信息，并添加几条和你姓名同姓的虚拟信息。

In [47]:
sql = "INSERT INTO user (name, sex, age, phone) VALUES (%s, %s, %s, %s)"
values = [('张三', 'Female', 20, '123-456-7890'), 
        ('张三', 'Female', 30, '987-654-3210'),
        ('张三', 'Male', 25, '555-123-4567')]
cursor.executemany(sql, values)

4. 写出 SQL语句,查询 user 表中年龄在 20-30 范围内,名字包含“你的姓氏”的用户,并按照年龄从大到小排序输出

In [48]:
sql = "SELECT * FROM user WHERE age BETWEEN 20 AND 30 AND name LIKE '张%' ORDER BY age DESC"
cursor.execute(sql)
for row in cursor:
    print(row)

(5, '张三', 'Female', 30, '987-654-3210')
(6, '张三', 'Male', 25, '555-123-4567')
(4, '张三', 'Female', 20, '123-456-7890')

5. 写出 SQL 语句,计算 user 表中所有用户的平均年龄

In [49]:
sql = "SELECT AVG(age) FROM user"
cursor.execute(sql)
for row in cursor:
    print(row)

(Decimal('25.5000'),)

6. 新建两张表team 表(id,teamName)和score 表(id,teamid,userid,score)。其中score 表中的 teamid 为指向 team表id 的外键，userid 为指向 user表id的外键

In [50]:
sql = "CREATE TABLE team (id INT AUTO_INCREMENT PRIMARY KEY, teamName VARCHAR(255))"
cursor.execute(sql)
sql = "CREATE TABLE score (id INT AUTO_INCREMENT PRIMARY KEY, teamid INT, userid INT, score INT, FOREIGN KEY (teamid) REFERENCES team(id), FOREIGN KEY (userid) REFERENCES user(id))"
cursor.execute(sql)

7. 在team表中和score表中插入合适的记录，写出 SQL语句,查询 teamName 为“ECNU”的队伍中，年龄小于 20 的用户们，结果不得为空。

In [51]:
sql = "INSERT INTO user (name, sex, age, phone) VALUES (%s, %s, %s, %s)"
values = ('李明', 'Male', 18, '123-456-7890')
cursor.execute(sql, values)

sql = "INSERT INTO team (teamName) VALUES ('ECNU')"
cursor.execute(sql)

sql = "INSERT INTO score (teamid, userid, score) VALUES (%s, %s, %s)"
values = [(1, 1, 100), (1, 2, 90), (1, 7, 80)]
cursor.executemany(sql, values)

In [52]:
sql = "SELECT u.name FROM user u, team t, score s WHERE u.age < 20 AND t.teamName = 'ECNU' AND t.id = s.teamid AND u.id = s.userid"
cursor.execute(sql)
for row in cursor:
    print(row)

('李明',)

8. 写出 SQL 语句,计算 teamName为“ECNU”的总分(假设 score 存在 null值,nul值默认为 0 加入计算)。

In [53]:
sql = "SELECT SUM(IFNULL(score, 0)) FROM team t, score s WHERE t.teamName = 'ECNU' AND t.id = s.teamid"
cursor.execute(sql)
for row in cursor:
    print(row)

(Decimal('270'),)

9. 写出SQL语句，删除user表中个人信息的记录。

In [54]:
sql = "DELETE FROM user WHERE name = '张三' AND age = 20 AND phone = '123-456-7890'"
cursor.execute(sql)

In [55]:
cursor.close()  
db.close()